var character_map = {
    'A': ["Ą", "💧", "Д", "Å", "∧", "ᐃ", "@", "ᥪ", "𝚫", "ᕕ", "🌀"],
    'B': ["ϐ", "ᵦ", "฿", "𝟾", "8"],
    'C': ["Ꞇ", "⸦", "ᙅ", "🌊"],
    'D': ["𐌃", "⌷", "ŋ", "ე"],
    'E': ["3", "ピ", "⊑", "⫕", "𐎛", "ᑢ", "∑"],
    'F': ["Ґ", "𝔽", "𝙵"],
    'G': ["𝔾", "Ǥ", "Ꮆ", "Ɠ", "ໆ", "𝟿", "𝕘", "ϧ"],
    'H': ["µ", "ꖾ", "Ӊ", "Џ", "👬", "👭", "👫"],
    'I': ["ヱ", "𝓘", "ℶ", "↥", "🏮", "🐛", "💈", "💉", "💊", "🔦"],
    'J': ["⥡", "⑀", "⥌", "⎎"],
    'K': ["K", "𐌊", "𝕂", "𝕜"],
    'L': ["Ꝇ", "꜕", "└", "👡"],
    'M': ["Җ", "⩚", "⨇", "ᗑ", "⫙", "⫛", "Ԡ", "⫚", "♏", "Ҧ", "👪"],
    'N': ["Ɲ", "Л", "ᜨ", "∧", "П", "⎍", "ᥥ", "ᜬ"],
    'O': ["𝙾", "◯", "▢", "0", "🔘", "🌕", "🌎", "Ø", "⎔", "❍", "💍", "⩍", "🍊", "💞", "Ѻ", "🌰", "🎯", "❤️", "⭕"],
    'P': ["𐌛", "ᑭ", "𝚙", "ℙ", "ᕈ", "Ᵽ", "⍴", "ƿ", "Ꮅ"],
    'Q': ["ⵚ", "℺", "Ⴓ", "Ɋ", "🎈"],
    'R': ["ⴽ", "ᖇ", "ҏ", "ք", "⌠"],
    'S': ["𝜻", "ﮐ", "$"],
    'T': ["𝍮", "Ƭ", "⫪", "🔨", "🌲"],
    'U': ["υ", "⨆", "∐", "ᙀ", "Ա", "🌙"],
    'V': ["⎷", "V", "√", "ᵥ", "۷", "ᵛ", "ѵ"],
    'W': ["ω", "ᥕ", "⍵", "ꟽ", "⨈", "👐"],
    'X': ["⤨", "╳", "⚔", "⤪", "⤧", "𝕏", "⤫", "🌟","🌠", "🔯"],
    'Y': ["ĭ", "Ỳ", "Ῡ", "🔧", "🌱"],
    'Z': ["ℤ", "೭", "2", "ƻ", "ϩ", "💤"]
};

var Say = function(input) {
    var out = "";
    input.split('').forEach(function(letter) {
        letter = letter.toUpperCase();
        if(character_map[letter]) {
            var length = character_map[letter].length;
            if (length > 0) {
                // get a random index of the array
                var index = Math.floor((Math.random() * length) + 0);
                out += character_map[letter][index];
            } else {
                out += letter;
            }
        } else {
            out += letter;
        }
    });
    return out;
};

if (typeof module === "object" && typeof module.exports === "object" ) {
    module.exports = Say;
} else {
    window.Say = Say;
}
